#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-38yQNB1aWP2MSKkE

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.config_bucket.random_id.this[0]: Refreshing state... [id=aPbH]
digitalocean_ssh_key.secondary: Refreshing state... [id=38557683]
digitalocean_ssh_key.m2: Refreshing state... [id=38210829]
digitalocean_droplet.postgres: Refreshing state... [id=359948759]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
aws_iam_user.configuration_deployer: Refreshing state... [id=configuration.deployer]
module.configuration_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-sfvz2s]
module.config_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-68f6c7]
module.postgres_backups.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-tr1pjq]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
module.f2_instance_new.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
module.remote_state.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
module.f2_instance_new.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
module.f2_instance_new.aws_iam_role.this: Refreshing state... [id=f2-role]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_user_login_profile.personal: Refreshing state... [id=alex.jackson]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_access_key.configuration_deployer: Refreshing state... [id=AKIAYEHTA3LZKXOXWTYC]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
module.f2_instance_new.aws_iam_instance_profile.this: Refreshing state... [id=f2-instance-profile]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
aws_route53_zone.internal: Refreshing state... [id=Z0474418KLUF1M8YKY2A]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
module.f2_instance_new.aws_security_group.this: Refreshing state... [id=sg-0b0c2706a115cea15]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.f2_instance_new.data.aws_subnet.self: Refreshing...
module.remote_state.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
module.config_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-68f6c7]
module.f2_instance_new.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/f2-policy]
aws_iam_user_policy.configuration_deployer: Refreshing state... [id=configuration.deployer:configuration.deployer.policy]
module.postgres_backups.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-tr1pjq]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
module.f2_instance_new.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
module.f2_instance_new.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-3819120690]
module.f2_instance_new.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-1497175691]
module.f2_instance_new.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-1488974477]
module.f2_instance_new.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-918024373]
module.f2_instance_new.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-3670505610]
module.f2_instance_new.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-3714648427]
module.f2_instance_new.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-2411040274]
module.f2_instance_new.aws_instance.this: Refreshing state... [id=i-0b5ea915378ecc291]
module.f2_instance_new.aws_iam_role_policy_attachment.this: Refreshing state... [id=f2-role-20231007085344887300000001]
module.f2_instance_new.aws_eip.this: Refreshing state... [id=eipalloc-088e677e1afd76c95]
aws_route53_record.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]
module.configuration_bucket.aws_s3_bucket.this: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_user_policy.configuration_deployer will be updated in-place
  ~ resource "aws_iam_user_policy" "configuration_deployer" {
        id     = "configuration.deployer:configuration.deployer.policy"
        name   = "configuration.deployer.policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:s3:::configuration-sfvz2s",
                          - "arn:aws:s3:::configuration-68f6c7",
                        ] -> "arn:aws:s3:::configuration-68f6c7"
                        # (2 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Resource = [
                          - "arn:aws:s3:::configuration-sfvz2s/f2/config.yaml",
                          - "arn:aws:s3:::configuration-68f6c7/f2/config.yaml",
                        ] -> "arn:aws:s3:::configuration-68f6c7/f2/config.yaml"
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.configuration_bucket.aws_s3_bucket_lifecycle_configuration.this[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket = "configuration-sfvz2s"
      + id     = (known after apply)

      + rule {
          + id     = "delete-files"
          + status = "Enabled"

          + expiration {
              + days                         = 1
              + expired_object_delete_marker = (known after apply)
            }
        }
      + rule {
          + id     = "delete-versioned-files"
          + status = "Enabled"

          + noncurrent_version_expiration {
              + noncurrent_days = 1
            }
        }
    }

  # module.configuration_bucket.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = "configuration-sfvz2s"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>